using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Test : MonoBehaviour
{
    /// 1.Що таке GameObject у Unity?
    ///     a) Файл сцени
    ///     +b) Базовий клас усіх об'єктів
    ///     c) Компонент фізики
    ///     d) Графічний шейдер
    /// 2. Яка роль компонента Transform
    ///     a) Зберігає колір
    ///     b) Керує шейдерами
    ///     +c) Зберігає поицію, обертання, масштаб
    ///     d) Відтворює звук
    /// 3. Prefab потрібен, щоб...
    ///     +a) Створити копію об'єкта із збереженнями налаштувань
    ///     b) Зберегти сцену
    ///     c) Компілювати шейдери
    ///     d) Контролювати аудіо
    /// 4. Який метод викликається одноразово після заввантаження об'єкта?
    ///     a) Update
    ///     +b) Start
    ///     c) FixedUpdate
    ///     d) OnEnable
    /// 5. Різниця між Update та FixedUpdate
    ///     a) Update викликається рідше
    ///     +b) FixedUpdate має рівні інтервали між кадрами
    ///     c) FixedUpdate працює тільки у редакторі
    ///     d) Update викликає колізії
    /// 6. Що таке сцена (Scene) у Unity?
    ///     a) Окремий файл налаштувань
    ///     +b) Контейнер, де знаходяться всі об'єкти рівня
    ///     c) Шрифт UI
    ///     d) Пакет текстур
    /// 7. OnTriggerEnter спрацює, якщо...
    ///     a) Обидва колайдери мають isTrigger = True
    ///     +b) Хоч один має isTrigger = True
    ///     c) Жоден не має isTrigger = True
    ///     d) Лише для CharacterController
    /// 8. SceneManager.LoadScene(1) у DangerObj.cs:
    ///     a) Перезавантажує поточну сцену
    ///     +b) Завантажує сцену з індексом 1
    ///     c) Виводить UI-меню
    ///     d) Зупиняє гру
    /// 9. У Spawner.cs список organisms окогошено як List<GameObjects>, щоб...
    ///     a) Зберігати позицію ворогів
    ///     +b) Динамічно вибирати, що саме спавнити
    ///     c) Логувати помилки
    ///     d) Експортувати JSON
    /// 10. Яка змінна у WASD_Move тримає посилання на камеру?
    ///     a) rb
    ///     b) Instance
    ///     +c) mainCamera
    ///     d) cameraDistance
    /// 11. Що робить CompareTag("Player")?
    ///     a) Присвоює тег об'єкту
    ///     b) Порівнює два рядки тегів
    ///     +c) Перевіряє, чи об'єкт має тег
    ///     d) Видаляє тег
    /// 12. Який модифікатор робить змінну видимою в інспекторі? (2 вірні відповіді)
    ///     +a) public
    ///     +b) [SerializeField]
    ///     c) protected
    ///     d) static
    /// 13. Ключове слово static у public static Wasd_Move Instance означає:
    ///     a) Створює копію об'єкту
    ///     +b) Єдине спільне поле для всих копій класу
    ///     c) Перезаписує скрипт
    ///     d) Приховує компонент
    /// 14. Щоб прив'язати компонент Rigidbody у скрипті до змінної, ми пишемо:
    ///     +a) GetComponent<Rigidbody>()
    ///     b) Find<Rigidbody>()
    ///     c) new Rigidbody()
    ///     d) AddComponent<Rigidbody>()
    /// 15. Sphere Colider зазвичай підходить для:
    ///     a) Кутових предметів
    ///     +b) Куль і м'ячів
    ///     c) Площин
    ///     d) UI-Кнопок
    ///     
    /// 16. Як зупинити об'єкт миттєво?
    ///     +a) rb.velocity = Vector3.zero;
    ///     b) transform.position = 0;
    ///     c) Stop();
    ///     d) Time.timeScale = 0;
    /// 17. Що повертає Input.GetAxis("Horizontal")?
    ///     a) true/false
    ///     +b) -1...1
    ///     c) 0...100
    ///     d) Текстовий рядок
    /// 18. Щоб перевірити вихід об'єкта з зони тригеру використовуємо:
    ///     +a) OnTriggerExit()
    ///     b) OnCollisionStay()
    ///     c) Update()
    ///     d) Awake()
    /// 19. TextMeshPro потрібен для:
    ///     a) Фізики частинок
    ///     +b) Високоякісного тексту
    ///     c) Збереження сцен
    ///     d) Спавну ворогів
    /// 20. Canvas - це...
    ///     a) Компонент для фізики
    ///     +b) Контейнер усіх UI-елементів
    ///     c) Скрипт для звуку
    ///     d) Система частинок
    /// 21. Щоб додати пакет, відкриваємо:
    ///     +a) Window > PackageManager
    ///     b) Edit > Preferences
    ///     c) Tools > AI
    ///     d) GameObject > Create
    /// 22. Build Settings дозволяє:
    ///     +a) Додавати сцени до збірки
    ///     b) Змінювати шрифти
    ///     c) Перейменовувати скрипти
    ///     d) Редагувати коллайдери
    /// 23. При червоній помилці в Console, перший крок:
    ///     a) Ігнорувати
    ///     b) Перезапустити ПК
    ///     +c) Клікнути
    ///     d) Видалити Library
    /// 24. Щоб уповільнити час у грі в 2 рази, достатньо:
    ///     +a) Time.timeScale = 0.5f;
    ///     b) FixedUpdate() = 0.5
    ///     c) QualitySettings.VSyncCount = 2;
    ///     d) Application.Slow();
    /// 25. Якщо об'єкт провалюється через підлогу, найчастіше причина
    ///     a) Відсутній матеріал
    ///     b) Collider неправильної форми
    ///     c) Забагато світла
    ///     +d) Відсутній або Trigger Collider
    /// 26. Vector3 може зберігати:
    ///     a) Параметри екрану
    ///     b) Колір персонажа
    ///     c) Назву сцени
    ///     +d) Позицію об'єкту
    /// 27. Чим відрізняються Awake та Start?
    ///     a) Кількістью параметрів
    ///     b) Час виконання
    ///     +c) Для Start об'єкт повинен бути активним
    ///     d) Awake виконується 2 рази
    /// 28. Float це:
    ///     a) Ціле число
    ///     b) Колір
    ///     c) Текст
    ///     +d) Дробове число
    /// 29. Bool може мати значення:
    ///     a) x,y,z
    ///     b) y/n
    ///     c) 1 або 2
    ///     +d) True/False
    /// 30. Як називається мова, на якій ми пишемо?
    ///     a) c
    ///     b) c++
    ///     +c) c#
    ///     d) Python
}
